Revit 2027 API
Application.NewDWFXExportOptions Method
Creates DWFX Export options.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DWFXExportOptions NewDWFXExportOptions()
Public Function NewDWFXExportOptions As DWFXExportOptions
public:
DWFXExportOptions^ NewDWFXExportOptions()
member NewDWFXExportOptions : unit -> DWFXExportOptions
Return Value
DWFXExportOptions
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace